# 41)Напишите программу на Python для поиска пересечения двух заданных массивов с помощью Lambda, filter.
# [1, 2, 3, 5, 7, 8, 9, 10]
# [1, 2, 4, 8, 9]

a1 = [1, 2, 3, 5, 7, 8, 9, 10]
a2 = [1, 2, 4, 8, 9]

res = list(filter(lambda x: x in a1, a2))
print(res)